Практос_2/src/Documents/ПубликацияВакансии/ПубликацияВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПубликацияВакансии</name>
  <basedOn>Document.ЗаявкаНаПодбор</basedOn>
  <registerRecords>AccumulationRegister.БюджетМаркетингаHR</registerRecords>
  <registerRecords>InformationRegister.ИсторияКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаПодбор</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Рубли</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазмещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРазмещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусОпубликованнойВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатратНаПодбор</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникПривлечения</name>
      <type>
        <types>CatalogRef.ИсточникПривлечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Рубли</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Практос_2/src/Documents/НазначениеИнтервью/НазначениеИнтервью.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеИнтервью</name>
  <registerRecords>InformationRegister.ИсторияКандидатов</registerRecords>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекрутер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодбора</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобеседованияИВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликацияВакансии</name>
    <type>
      <types>DocumentRef.ПубликацияВакансии</types>
    </type>
  </attributes>
</mdclass:Document>

Практос_2/src/Documents/ПубликацияВакансии/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ДатаНачалаРазмещения = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	//Если Статус = Перечисления.СтатусОпубликованнойВакансии.Закрыта тогда 
	//	Сообщить("ничего");
	//появляется модальное окно предлагаещее выполнить ввод на основании
	// и появляется кнопка ввод на основании Закрытие вакансии 
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИнтервью(Команда)
ТекущаяСтрока = Элементы.ТаблицаОткликов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, "Выберите кандидата из списка!");
		Возврат;
	КонецЕсли;
	
	// Создаем структуру параметров для новой формы
	ПараметрыФормы = Новый Структура;
	
	// 1. Кандидата берем из выделенной строки динамического списка
	ПараметрыФормы.Вставить("ПараметрКандидат", ТекущаяСтрока.Кандидат);
	
	// 2. Вакансию берем из шапки текущего документа Публикации
	ПараметрыФормы.Вставить("ПараметрВакансия", Объект.Вакансия);
	
	// 3. Рекрутера (Ответственного) берем из шапки текущего документа Публикации
	// (замените Объект.Ответственный на ваше имя реквизита, если он называется иначе, например Рекрутер)
	ПараметрыФормы.Вставить("ПараметрРекрутер", Объект.Ответственный);
	
	// Открываем форму
	ОткрытьФорму("Документ.НазначениеИнтервью.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры// В модуле документа ПубликацияВакансии в процедуре ОбработкаПроведения вам нужно реализовать сразу два движения:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// 1. Очищаем старые отборы, чтобы они не дублировались
	ИмяПеременнойСписка = "СписокОткликов"; // <-- УКАЖИТЕ ЗДЕСЬ ИМЯ ВАШЕГО РЕКВИЗИТА СПИСКА
	ДинамическийСписок = ТаблицаОткликов;
	ДинамическийСписок.Отбор.Элементы.Очистить();
	
	// 2. Создаем новый элемент отбора
	ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	// Важно: "Публикация" — это имя Измерения в регистре сведений. 
	// Если в регистре оно называется "Вакансия", то напишите "Вакансия"
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Публикация"); 
	
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	ЭлементОтбора.Использование  = Истина;
	
	// 3. Включаем важнейшее свойство для стандартной кнопки!
	// Оно запрещает пользователю менять этот отбор и заставляет платформу подставлять его при создании
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры
// расход бюджета и приход в затраты.

// Для диплома это идеальный пример сложной бизнес-логики, где один документ связывает два разных контура учета: 
//	 
//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	// Контроль заполнения обязательных полей перед проведением
//	Если Не ЗначениеЗаполнено(Сумма) Тогда
//		Сообщить("Не указана сумма публикации!");
//		Отказ = Истина;
//		Возврат;
//	КонецЕсли;

//	// ДВИЖЕНИЕ 1: Списание из бюджета HR-маркетинга (РАСХОД)
//	ДвижениеБюджет = Движения.БюджетМаркетингаHR.Добавить();
//	ДвижениеБюджет.ВидДвижения = ВидДвиженияНакопления.Расход;
//	ДвижениеБюджет.Период      = Дата;
//	
//	// Заполняем измерения регистра БюджетМаркетингаHR
//	ДвижениеБюджет.ИсточникПривлечения = ИсточникПривлечения;
//	ДвижениеБюджет.СтатьяЗатрат        = СтатьяЗатрат;
//	// Заполняем ресурс
//	ДвижениеБюджет.Сумма               = Сумма;


//	// ДВИЖЕНИЕ 2: Фиксация стоимости подбора под вакансию (ПРИХОД)
//	ДвижениеЗатраты = Движения.ЗатратыНаПодбор.Добавить();
//	ДвижениеЗатраты.ВидДвижения = ВидДвиженияНакопления.Приход;
//	ДвижениеЗатраты.Период      = Дата;
//	
//	// Заполняем измерения регистра ЗатратыНаПодбор
//	ДвижениеЗатраты.Вакансия     = Вакансия;
//	ДвижениеЗатраты.СтатьяЗатрат = СтатьяЗатрат;
//	// Заполняем ресурс
//	ДвижениеЗатраты.Сумма        = Сумма;

//КонецПроцедуры

//Дополнительный плюс для текста ВКР:
//Реквизиты ДатаНачалаРазмещения и ДатаОкончанияРазмещения позволят вам в будущем развить систему:
//например, написать регламентное задание, которое будет автоматически напоминать рекрутеру
//в «1С», что публикация на HeadHunter по вакансии "Программист 1С" истекает через 2 дня и её нужно обновить или снять.
//Это покажет высокий уровень проработки информационной системы на защите.
